espressif/esp-iot-solution/components/display/tools/esp_lvgl_adapter/test_apps/lvgl9/sdkconfig.defaults.esp32c3
CONFIG_IDF_TARGET="esp32c3"
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=n

CONFIG_ESP_LVGL_ADAPTER_ENABLE_BUTTON=y
CONFIG_ESP_LVGL_ADAPTER_ENABLE_KNOB=y

CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ESP32C3 LCDKit
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
